//-----------------------------------------------------------------
// 程序描述:
//    	延时程序头文件
// 当前版本: V1.0
// 历史版本:
// 说    明: 
//
//-----------------------------------------------------------------
#ifndef _DELAY_H
#define _DELAY_H
#include "stm32l475_user.h"
//-----------------------------------------------------------------
// 定义
//-----------------------------------------------------------------
#define SystemClock				80				// 系统时钟（单位：MHz）
#define FAC_us				SystemClock/5	// 延时因子
//-----------------------------------------------------------------
// 函数声明
//-----------------------------------------------------------------
extern void delay_20ns(u32 nns);
extern void delay_ms(u16 nms);
extern void delay_us(u32 nus);
extern void SysTick_clkconfig(u8 SYSCLK);
extern void SysTick_delay_us(u32 nus);
extern void SysTick_delay_ms(u16 nms);
#endif
//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
